In [2]:
import numpy as np
import pandas as pd

### Q1.

In [3]:
s = pd.Series([9904312, 3448737, 2890451, 2466052], 
               index=['서울','부산','인천','대구'])
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [4]:
s1 = pd.Series([9904312, 3448737, 2890451, 1490158], 
                index=['서울','부산','인천','대전'])
s1

서울    9904312
부산    3448737
인천    2890451
대전    1490158
dtype: int64

In [5]:
s + 1000

서울    9905312
부산    3449737
인천    2891451
대구    2467052
dtype: int64

In [6]:
s - 100

서울    9904212
부산    3448637
인천    2890351
대구    2465952
dtype: int64

In [7]:
s1 * 3

서울    29712936
부산    10346211
인천     8671353
대전     4470474
dtype: int64

In [8]:
s1 / 2

서울    4952156.0
부산    1724368.5
인천    1445225.5
대전     745079.0
dtype: float64

### Q2.

In [9]:
data = { 
    '2020': [9831482, 3693191, 2632035, 2531774, 1838290], 
    '2015': [9762514, 3526890, 2517847, 2456072, 1781389], 
    '2010': [9853711, 3655437, 2466339, 2473990, 1620465], 
    '지역': ['수도권', '경상권', '수도권', '경상권', '수도권'], 
    '2015-2020 증가율': [0.7, 4.7, 4.5, 3.1, 3.2]
}
columns = ['지역', '2020', '2015', '2010', '2015-2020 증가율']
index = ['서울', '부산', '인천', '대구', '과천']
df = pd.DataFrame(data, index=index, columns=columns)
df

     지역     2020     2015     2010  2015-2020 증가율
서울  수도권  9831482  9762514  9853711            0.7
부산  경상권  3693191  3526890  3655437            4.7
인천  수도권  2632035  2517847  2466339            4.5
대구  경상권  2531774  2456072  2473990            3.1
과천  수도권  1838290  1781389  1620465            3.2

### Q3.

In [10]:
data = {
    '국어': [80, 90, 70, 30],
    '영어': [90, 70, 60, 40], 
    '수학': [90, 60, 80, 70]
}
columns = ['국어', '영어', '수학']
index = ['춘향', '몽룡', '향단', '방자']
df = pd.DataFrame(data, index=index, columns=columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [11]:
# 1) 모든 학생의 수학 점수를 시리즈로 나타낸다.
df['수학']

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [12]:
# 2) 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.
df[['국어', '영어']]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [13]:
np.mean(df.values, axis = 1)

array([86.66666667, 73.33333333, 70.        , 46.66666667])

In [14]:
df.mean(axis = 1)

춘향    86.666667
몽룡    73.333333
향단    70.000000
방자    46.666667
dtype: float64

In [15]:
# 3) 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.
df['평균'] = ((df.mean(axis=1)).round(2))
df

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  40  70  46.67

In [16]:
df['평균2'] = np.mean(df.values[:,:-1], axis=1).round(2)
df

    국어  영어  수학     평균    평균2
춘향  80  90  90  86.67  86.67
몽룡  90  70  60  73.33  73.33
향단  70  60  80  70.00  70.00
방자  30  40  70  46.67  46.67

In [17]:
# 4) 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.
df.drop(columns=['평균','평균2'], inplace=True)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [18]:
df['영어']['방자'] = 80
df['평균'] = ((df.mean(axis=1)).round(2))
df

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  80  70  60.00

In [19]:
data = {
    '국어': [80, 90, 70, 30],
    '영어': [90, 70, 60, 40], 
    '수학': [90, 60, 80, 70]
}
columns = ['국어', '영어', '수학']
index = ['춘향', '몽룡', '향단', '방자']
df1 = pd.DataFrame(data, index=index, columns=columns).copy()
df1

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [20]:
df1['평균'] = ((df.mean(axis=1)).round(2)).copy()
df1

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  40  70  60.00

In [21]:
df1['영어']['방자'] = 80
# 이 값을 바꿈으로써 평균에 영향을 주기 때문에 warning 문구가 뜸

#warning 문구 없애기
#import warnings
# warnings.filterwarnings('ignore')

<ipython-input-21-c3828feb1529>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1['영어']['방자'] = 80

In [22]:
df1

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  80  70  60.00

In [23]:
# 5) 춘향의 점수를 데이터프레임으로 나타낸다.
df.head(1)

    국어  영어  수학     평균
춘향  80  90  90  86.67

In [24]:
df.head(3).tail(1)

    국어  영어  수학    평균
향단  70  60  80  70.0

In [25]:
df.T

       춘향     몽룡    향단    방자
국어  80.00  90.00  70.0  30.0
영어  90.00  70.00  60.0  80.0
수학  90.00  60.00  80.0  70.0
평균  86.67  73.33  70.0  60.0

In [26]:
df.T[['춘향']]

       춘향
국어  80.00
영어  90.00
수학  90.00
평균  86.67

In [27]:
df[:'춘향']

    국어  영어  수학     평균
춘향  80  90  90  86.67

In [28]:
df[:1]

    국어  영어  수학     평균
춘향  80  90  90  86.67

In [29]:
# 6) 향단의 점수를 시리즈로 나타낸다.
df.T['향단']

국어    70.0
영어    60.0
수학    80.0
평균    70.0
Name: 향단, dtype: float64

### Q4.

In [30]:
# 1) 모든 행과 열에 라벨을 가지는 5 x 5 이상의 크기를 가지는 데이터프레임을 만든다.
df = pd.DataFrame(np.arange(25).reshape(5,5), columns=list('ABCDE'), index=list('vwxyz'))
df

    A   B   C   D   E
v   0   1   2   3   4
w   5   6   7   8   9
x  10  11  12  13  14
y  15  16  17  18  19
z  20  21  22  23  24

In [31]:
# 2) 10가지 이상의 방법으로 특정한 행과 열을 선택한다.
df['C']['x'], df['C'][2], df.C['x'], df.C[2], df.C.x

(12, 12, 12, 12, 12)

In [32]:
# loc indexer
df.loc['x','C'], df.loc['x'][2], df.loc['x']['C']

(12, 12, 12)

In [33]:
# iloc indexer
df.iloc[2,2], df.iloc[2]['C'], df.iloc[2][2]

(12, 12, 12)